/*
    District P
    아두이노 코딩#19
    7 세그먼트 다루기
*/

// 7 세그먼트의 핀 수(점까지)
#define maxSegmentCnt 8
// 7 세그먼트에 연결된 핀들(a,b,c...)
unsigned char segmentPins[maxSegmentCnt] = {2, 3, 4, 5, 6, 7, 8, 9};

//----------------------- 7 세그먼트 핀 -> 숫자 표 --------------------

/*
// 공통 애노드인 경우
unsigned char digitNum[10][8] = {
    {0, 0, 0, 0, 0, 0, 1, 1}, //0
    {1, 0, 0, 1, 1, 1, 1, 1}, //1
    {0, 0, 1, 0, 0, 1, 0, 1}, //2
    {0, 0, 0, 0, 1, 1, 0, 1}, //3
    {1, 0, 0, 1, 1, 0, 0, 1}, //4
    {0, 1, 0, 0, 1, 0, 0, 1}, //5
    {0, 1, 0, 0, 0, 0, 0, 1}, //6
    {0, 0, 0, 1, 1, 1, 1, 1}, //7
    {0, 0, 0, 0, 0, 0, 0, 1}, //8
    {0, 0, 0, 0, 1, 0, 0, 1}  //9
};
//사용
*/

unsigned char digitNum[10][8] = {
    {1, 1, 1, 1, 1, 1, 0, 0}, //0
    {0, 1, 1, 0, 0, 0, 0, 0}, //1
    {1, 1, 0, 1, 1, 0, 1, 0}, //2
    {1, 1, 1, 1, 0, 0, 1, 0}, //3
    {0, 1, 1, 0, 0, 1, 1, 0}, //4
    {1, 0, 1, 1, 0, 1, 1, 0}, //5
    {1, 0, 1, 1, 1, 1, 1, 0}, //6
    {1, 1, 1, 0, 0, 0, 0, 0}, //7
    {1, 1, 1, 1, 1, 1, 1, 0}, //8
    {1, 1, 1, 1, 0, 1, 1, 0}, //9
};

//----------------------------------------------------------

void setup() {
    for (int i=0; i<maxSegmentCnt; i++) {
        pinMode(segmentPins[i], OUTPUT);
    }
}

void loop() {
    for (int i=0; i<10 ; i++) {
        // 7 세그먼트의 각 핀을
        for (int j=0; j<maxSegmentCnt; j++) {
            // 숫자 테이블을 참조하여 숫자 i를 표현
            digitalWrite(segmentPins[j], digitNum[i][j]);
        }
        delay(1000);
    }
}